app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY created_at desc
---
  def index
    @posts = Post.all.order("created_at desc")

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "She is an amazing woman."], ["created_at", "2014-06-12 05:37:50.576897"], ["title", "I love Her"], ["updated_at", "2014-06-12 05:37:50.576897"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 22  [["body", "I am in love, never thought I would find love after a divorce. :)"], ["updated_at", "2014-06-16 22:39:00.437949"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)